Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/state_examinations/leaving_certificate_applied.html.txt.tmx
Source language: en
Languages: ga

source: The Leaving Certificate Applied is a distinct, self-contained two-year Leaving Certificate programme aimed at preparing students for adult and working life
ga: Is clár 2 bhliain an-speisialta, dlúth, é an Ardteistiméireacht Fheidhmeach, atá mar chuspóir aige scoláirí a ullmhú i gcóir an tsaoil oibre agus an saol fásta

source: The programme sets out to recognise the talents of all students and to provide opportunities for developing personal responsibility, self-esteem and self-knowledge
ga: Díríonn an clár ar bhuanna na scoláirí agus cabhraíonn sé le scoláirí cibé rud a fhoghlaimíonn siad a chuir in oiriúint don saol

source: The two-year programme consists of four half-year blocks called sessions
ga: Séard atá sa gclár 2 bhliain ná blocanna 4 leath-bhliana ar a ghlaotar seisiúin

source: Achievements are credited in each session
ga: Baintear amach creidiúintí i ngach seisiún

source: There is more information in this overview of the Leaving Certificate Applied (pdf)
ga: Tá tuilleadh faisnéise sa bhileog faoin Ardteistiméireacht Fheidhmeach (pdf) ar fáil

source: Courses are offered in three main areas:
ga: Tá na cúrsaí ar fáil i dtrí phríomh-réimse:

source: • Vocational preparation, involving work experience, enterprise and communication
ga: • Ullmhú ghairmeach, tagann taithí oibre, fiontair agus cumarsáide faoi seo

source: • General education, offering lifeskills, the arts, social education, leisure and language
ga: • Oideachas ghinearálta, ag tairiscint scileanna saoil, ealaíon, oideachas shóisialta, caitheamh aimsire agus teanga

source: Each course consists of a number of modules
ga: Tá gach cúrsa déanta suas de roinnt módúl

source: Each module takes place over half a year
ga: Déantar gach módúl thar tréimhse leathbhliana

source: There is also a wide range of practical courses, called vocational specialisms, from which the student can choose
ga: Tá réimse leathan de chúrsaí praiticúla ann ar a nglaotar sainghnéithe gairmeacha orthu inár féidir leis an scoláire roghnú a dhéanamh

source: Assessment is continuous throughout the course and there is a final examination
ga: Déantar measúcháin go leanúnach i rith an chúrsa agus tá scrúdú deireanach ann

source: Assessment takes place on the completion of modules and practical activities that allow the student to integrate the learning from different courses
ga: Déantar an measúchán nuair atá na módúil agus na gníomhaíochtaí praiticiúla críochnaithe, rud a thugann deis don scoláire an fhoghlaim a chomhthathú ó chúrsaí difriúla

source: The final examination must be taken in the following areas:
ga: Caithfear an scrúdú deireanach dhéanamh sna réimsí seo :

source: There are written and oral examinations in all languages
ga: Tá scrúdú scríofa agus scrúdú béil i ngach teanga

source: There are practical examinations in the vocational specialisms
ga: Tá scrúduithe praiticiúla ins na sainghnéithe gairmiúla

source: The written examinations take place in June, at the same time as the examinations for the established Leaving Certificate
ga: Déantar na scrúduithe scríofa i mí Meithimh ag an am céanna is a dhéantar na scrúduithe i gcóir na hArdteistiméireachta Bunaithe

source: Students who successfully complete the programme are awarded a Leaving Certificate from the Department of Education and Skills
ga: Bronntar Ardteistiméireacht ar na scoláirí a éiríonn leo an clár a chríochnú

source: The certificate is awarded at three levels:
ga: Bronntar an teastas ar thrí leibhéal:

source: Level Marks and Credits Required
ga: Leibhéal Creidiúintí is gá riachtanach

source: Pass 60-69% (120-139 credits)
ga: Pass 60-69% (120-139 creidiúintí)

source: Merit 70-84% (140-169 credits)
ga: Fiúntas 70-84% (140-169 creidiúintí)

source: Distinction 85-100% (170-200 credits)
ga: Céimíocht 85-100% (170-200 creidiúintí)

source: Candidates who get less than 60% (120 credits) or who do not complete the course, are awarded a record of experience
ga: Bronntar Tuairisc Taithíochta ar na hiarrthóirí a fháigheann níos lú ná 60 creidiúintí nó nach gcríochnaíonn an cúrsa

source: Eligibility for further education and third-level courses
ga: I dteideal oideachas níos airde agus cúrsaí triú-leibhéil eile

source: A student who has been awarded the Leaving Certificate Applied can go on to a very wide range of Post-Leaving Certificate courses (PLCs)
ga: Is féidir le scólaire atá Ardteistiméireacht Fheidhmeach bronnta air/uirthi dul chuig réimse leathan Cúrsaí Iar-Ardteistiméireachta (CIAT)

source: These are available in local post-primary schools and colleges
ga: Cuirtear na cúrsaí seo ar fáil sna meánscoileanna agus sna coláistí áitiúla

source: There are many areas of study - Art/Design, Business, Science, Services/Leisure and Communications/Media studies
ga: Tá go leor réimse staidéir ann – Ealaín/Dearadh, Gnó, Eolaíocht, Seirbhísí/Fóillíocht agus Staidéir Chumarsáid agus ar na Meáin

source: PLC courses can lead on to an award recognised by the National Framework of Qualifications (NFQ)
ga: Féadfar gradam a bhronnadh ort tar éis cúrsaí PLC a dhéanamh, a aithníonn an Creat Náisiúnta Cáilíochtaí (NFQ)

source: You can find out if your course is recognised by NFQ
ga: Féadfaidh tú a dheimhniú an bhfuil do chúrsa aitheanta ag an NFQ anseo

source: Students with the Leaving Certificate Applied cannot gain direct entry through the Central Applications Office (CAO) system to the universities or institutes of technology
ga: Ní féidir le daltaí a rinne an Ardteistiméireacht Fheidhmeach iontráil dhíreach a fháil ar chóras na Lár-Oifige Iontrála (CAO) go dtí na hollscoileanna nó na hinstitiúidí teicneolaíochta

source: Many PLC courses lead to either a level 5 or level 6 award
ga: Eascraíonn gradam leibhéal 5 nó 6 as go leor cúrsaí PLC

source: In some cases, you can progress with this award to a third level course in a higher education institution such as, institutes of technology and universities
ga: I roinnt cásanna, féadfaidh tú leanúint ort leis an ngradam seo, chuig cúrsa tríú leibhéal in institiúid ardoidechais, ar nós institiúidí teicneolaíochta agus ollscoileanna

source: You should discuss your options for progression with your course provider
ga: Ba cheart duit do chuid roghanna chun dul ar aghaidh a phlé le soláthróir do chúrsa

source: Students cannot go directly to nursing but may be eligible to apply as a mature student with certain qualifications or relevant experience
ga: Ní féidir le scoláirí dul díreach chuig banaltracht ach d'fhéadfadh an ceart a beith acu chun iarratas a dhéanamh mar scoláire fásta le cáilithíochtaí áirithe sa CCOTL nó taithí chuí

source: Students with the Leaving Certificate Applied can also go on to FÁS Apprenticeship programmes
ga: Is féidir le scoláirí atá Ardteistiméireacht Fheidhmeach bronnta orthu dul ar Chláir Phrintíseachta FÁS

source: Many students go directly to employment
ga: Téann go leór scoláirí díreach chuig fostaíocht

source: The fee for entry for school-based students of the Leaving Certificate Applied for 2017 is €116
ga: Is é €116 an táille iontrála don bhliain 2017 do mhic léinn scoile de chuid Ghairmchlár na hArdteistiméireachta

source: Further information on State examination fees is here
ga: Tá tuilleadh eolais faoi tháillí scrúduithe Stáit ar fáil anseo

source: Candidates who hold a current medical card or who are dependent on a parent or guardian who holds a current medical card are exempt from paying examination fees
ga: Tá iarrthóirí a bhfuil cárta leighis reatha acu nó is cleithiúnaithe de chuid tuismitheora nó caomhnóra a bhfuil cárta leighis reatha aige nó aici díolmhaithe ó tháillí scrúduithe a íoc

source: Applicants who are claiming exemption from fees on this basis must provide medical card details to the Commission
ga: Ní foláir d’iarratasóirí a bhfuil díolúine ó tháillí á héileamh acu ar an mbonn sin sonraí maidir leis an gcárta leighis a sholáthar don Choimisiún

source: Applications from external candidates received after 8 February 2017 are subject to late fees even if the initial fee has been waived
ga: Tá iarratais ó iarrthóirí seachtracha a fhaightear tar éis an 8 Feabhra 2017 faoi réir táillí deireanacha fiú má rinneadh an táille thosaigh a tharscaoileadh

source: If you are a post-primary school student, your details will be sent to the State Examinations Commission by your school. If you are an external (non-school) candidate for the Leaving Certificate Applied you can apply online or on the application form available from the State Examinations Commission (SEC)
ga: Más scoláire thú atá ar freastal ar scoil dara leibhéil, cuirfidh an scoil do chuid sonraí chuig Comisiúin na Scrúduithe Stáit Más iarrthóir seachtrach thú (nach bhfuil ag freastal ar scoil) don Ardteistiméireacht Fheidhmeach, ba chóir d’iarratas ar líne nó i scríbhinn dhéanamh agus a bheith curtha chuig Coimisiún na Scrúduithe Stáit faoin dáta deiridh

source: You can find the written examination timetable (pdf) and the timetable for practical work (pdf) on the SEC website. You can view previous Leaving Certificate Applied examination papers on the SEC website
ga: Tá tráthchlár scrúduithe scriofa Ardteistiméireacht Fheidhmeach (pdf), tráthclár oibre chursa (pdf) agus páipéir scrúidaithe le feiceáil ar shuíomh gréasáin an Choimisiúin
